Repository: 84000/data-translation-memory
Catalog: Toh_134-The_Absorption_That_Encapsulates_All_Merit-v2.tmx
Source language: bo
Languages: en

source: སྲེད་མེད་ཀྱི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་བརྒྱ་བྱིན་དང་མཉམ་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དང་ལྡན་པར་གྱུར་ཀྱང་དེ་དག་ཐམས་ཅད་ནི་ཚངས་པ་ཆེན་པོའི་བསོད་ནམས་ཀྱི་ཕུང་པོའི་བརྒྱའི་ཆར་ཡང་མི་ཕོད་པ་ནས་རྒྱུའི་བར་དུ་ཡང་མི་བཟོད་དོ། །
en: Nārāyaṇa, even if all beings included in the great billionfold universe had the same amount of merit as Śakra, their collected merit would still not match one hundredth of the amount of merit possessed by Great Brahmā; it would not even bear comparison.

source: སྲེད་མེད་ཀྱི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཚངས་པ་ཆེན་པོ་དང་མཉམ་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དང་ལྡན་པར་གྱུར་ཀྱང་དེ་དག་ཐམས་ཅད་ནི་དགེ་བསྙེན་ནག་པོའི་མཆོག་གི་བསོད་ནམས་ཀྱི་ཕུང་པོའི་བརྒྱའི་ཆར་ཡང་མི་ཕོད་པ་ནས་རྒྱུའི་བར་དུ་ཡང་མི་བཟོད་དོ། །
en: Nārāyaṇa, even if all beings contained in the great billionfold universe had the same amount of merit as Great Brahmā, their collected merit would still not match one hundredth of the amount of merit possessed by Layman Kṛṣṇa; it would not even bear comparison.

source: སྲེད་མེད་ཀྱི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་དགེ་བསྙེན་ནག་པོའི་མཆོག་དང་མཉམ་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དང་ལྡན་པར་གྱུར་ཀྱང་དེ་དག་ཐམས་ཅད་ནི་ཤཱ་རིའི་བུའི་ཤེས་རབ་དང་། ཡེ་ཤེས་དང་བསོད་ནམས་ཀྱི་ཕུང་པོའི་བརྒྱའི་ཆར་ཡང་མི་ཕོད་པ་ནས་རྒྱུའི་བར་དུ་ཡང་མི་བཟོད་དོ། །
en: Nārāyaṇa, even if all beings contained in the great billionfold universe had the same amount of merit as Layman Kṛṣṇa, their collected insight, wisdom, and merit would still not match one hundredth of the amount possessed by Śāriputra; it would not even bear comparison.

source: སྲེད་མེད་ཀྱི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཤཱ་རིའི་བུ་དང་མཉམ་པའི་ཤེས་རབ་དང་། ཡེ་ཤེས་དང་བསོད་ནམས་ཀྱི་ཕུང་པོ་དང་ལྡན་པར་གྱུར་ཀྱང་། དེ་དག་ཐམས་ཅད་ནི་རང་སངས་རྒྱས་གཅིག་གི་ཤེས་རབ་དང་། ཡེ་ཤེས་དང་བསོད་ནམས་ཀྱི་ཕུང་པོའི་བརྒྱའི་ཆར་ཡང་མི་ཕོད་པ་ནས་རྒྱུའི་བར་དུ་ཡང་མི་བཟོད་དོ། །
en: “Nārāyaṇa, even if all beings contained in the great billionfold universe had the same amount of insight, wisdom, and merit as Śāriputra, their collected insight, wisdom, and merit would still not match one hundredth of the quantity possessed by a solitary buddha; it would not even bear comparison.

source: སྲེད་མེད་ཀྱི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་རང་སངས་རྒྱས་ཀྱི་ཤེས་རབ་དང་། ཡེ་ཤེས་དང་བསོད་ནམས་ཀྱི་ཕུང་པོ་དང་ལྡན་པར་གྱུར་ཀྱང་དེ་དག་ཐམས་ཅད་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ངེས་པར་བྱུང་ནས་བསྐལ་པ་ལྔ་བརྒྱ་ལོན་པའི་ཤེས་རབ་དང་། ཡེ་ཤེས་དང་བསོད་ནམས་ཀྱི་ཕུང་པོའི་བརྒྱའི་ཆར་ཡང་མི་ཕོད་པ་ནས་རྒྱུའི་བར་དུ་ཡང་མི་བཟོད་དོ། །
en: Nārāyaṇa, even if all beings contained in the great billionfold universe had as much insight, wisdom, and merit as a solitary buddha, their collected insight, wisdom, and merit would still not match one hundredth of the amount possessed by a bodhisattva great being who has been definitively emerged for five hundred eons; it would not even bear comparison.

source: ཐམས་ཅད་ལ་ཡང་དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: We could continue this way.

source: སྲེད་མེད་ཀྱི་བུ་འདི་ནི་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་ལ་འཇུག་པ་བཞི་པའོ། །
en: Nārāyaṇa, this was the fourth introduction to the absorption that encapsulates all merit.”

source: བསྟན་པ་འདི་བཤད་པ་ན། མི་སུམ་ཁྲི་ཉིས་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: As this sermon was expounded, 32,000 people formed the resolve set on unsurpassed and completely perfect enlightenment.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཡང་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ། །
en: The great trichiliocosm system also shook in six ways.

source: ལྷ་དང་མིའི་སིལ་སྙན་དག་ཀྱང་གྲག་གོ། །
en: The music of human and divine instruments sounded,

source: ལྷ་དང་མིའི་མེ་ཏོག་གི་སྤྲིན་དག་ཀྱང་ཕབ་སྟེ།
en: and a shower of human and divine flowers fell in clouds,

source: མེ་ཏོག་གི་སྤྲིན་དེ་དག་གིས་ས་ཆེན་པོ་འདི་པུས་མོ་ནུབ་ཙམ་དུ་བཀྲམ་མོ། །
en: until the whole earth was knee-deep in those clouds of flowers.

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་ཚིག་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: And in unison, gods, humans, nāgas, yakṣas, gandharvas, demigods, garuḍas, kiṃnaras, mahoragas, Śakra, Brahmā, and the world protectors, all spoke these words:

source: བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དང་། སྐྱེད་པ་དང་། སྐྱེད་པར་འགྱུར་བ་གང་དག་ལགས་པ་དེ་དག་གིས་ནི་བདག་ཅག་ཟིལ་གྱིས་གནོན་ཏོ། །
en: “Blessed One, we are outdone by those sons or daughters of noble family who have formed, who form, and those who will form the resolve set on unsurpassed and perfectly complete awakening.

source: བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་སེམས་ཅན་དེ་དག་གི་དོན་བགྱིད་པ་ལགས་སོ། །
en: Blessed One, we will work for the sake of those beings.

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་བདག་ཅག་གིས་འཚལ་བ་ལྟར་ན་སེམས་ཅན་གང་སུ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་མ་ཞུགས་པ་དེ་དག་ནི་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་ལས་མངོན་པར་བྱུང་བ་ཡང་མ་ལགས།
en: According to our understanding of what the Blessed One has said, anyone who does not set out toward unsurpassed and completely perfect awakening will not manifest out of the absorption that encapsulates all merit,

source: དེ་དག་ཐམས་ཅད་ནི་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་ལ་ཡང་དག་པར་གཞོལ་བ་ཡང་མ་ལགས་ཀྱི།
en: nor will any of them genuinely immerse themselves in that absorption that encapsulates all merit.

source: བཅོམ་ལྡན་འདས་གང་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དེ་དག་ཐམས་ཅད་ནི་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་ལས་མངོན་པར་བྱུང་བ་ཡང་ལགས། དེ་དག་ཐམས་ཅད་ནི་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་དེ་ལ་ཡང་དག་པར་གཞོལ་བ་ཡང་ལགས་སོ། །
en: On the other hand, Blessed One, anyone who forms the resolve set on unsurpassed and completely perfect awakening will certainly manifest out of the absorption that encapsulates all merit, and become genuinely immersed in that absorption that encapsulates all merit.”

source: ལེའུ་དང་པོའོ།། །།
en: This concludes the first chapter.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then the mighty strongman Vimalatejā inquired of the Blessed One, “

source: བཅོམ་ལྡན་འདས་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པར་བགྱིད་པའི་ཆོས་རྣམས་གང་ལགས།
en: Blessed One, what are the instructions for attaining this absorption that encapsulates all merit?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One replied to the mighty strongman Vimalatejā,

source: རིགས་ཀྱི་བུ་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་པར་བྱེད་པའི་ཆོས་གཅིག་སྟེ།
en: “Son of noble family, there is one single instruction for attaining this absorption that encapsulates all merit.

source: གཅིག་གང་ཞེ་ན།
en: What is it?

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་མི་གཏོང་བ་སྟེ།
en: It is to not forsake the omniscient mind.

source: རིགས་ཀྱི་བུ་ཆོས་གཅིག་པོ་འདི་ནི་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་པར་བྱེད་པའོ། །
en: Son of noble family, through this instruction alone will one attain the absorption that encapsulates all merit.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་པར་བྱེད་པའི་ཆོས་གཉིས་ཏེ།
en: “Son of noble family, there could also be said to be two instructions for attaining the absorption that encapsulates all merit.

source: གཉིས་གང་ཞེ་ན།
en: What are these two?

source: མཉན་པའི་ཆོས་ཡོངས་སུ་ཚོལ་བས་ཆོག་མི་ཤེས་པ་དང་། ཇི་ལྟར་ཐོས་པའི་ཆོས་ལ་ཚུལ་བཞིན་དུ་སོ་སོར་རྟོག་པ་སྟེ།
en: They are to be unrelenting in seeking out oral instructions, and to assimilate those instructions correctly, just as one hears them.

source: རིགས་ཀྱི་བུ་ཆོས་འདི་གཉིས་ནི་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་པར་བྱེད་པའོ། །
en: Son of noble family, through these two instructions will one attain the absorption that encapsulates all merit.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་པར་བྱེད་པའི་ཆོས་གསུམ་སྟེ།
en: “Moreover, son of noble family, there could be said to be three instructions for attaining the absorption that encapsulates all merit.

source: གསུམ་གང་ཞེ་ན།
en: What are these three?

source: སྡིག་པ་ཐམས་ཅད་ཡོངས་སུ་སྤོང་བ་དང་། དགེ་བའི་ཆོས་རྣམས་མངོན་པར་འདུ་བྱེད་པ་དང་། ཡོངས་སུ་བསྔོ་བ་ལ་མཁས་པ་སྟེ།
en: They are to give up negativity, to bring about positive qualities, and to be skilled in dedicating merit.

source: རིགས་ཀྱི་བུ་ཆོས་གསུམ་པོ་དེ་དག་ནི་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་པར་བྱེད་པའོ། །
en: Son of noble family, through these three instructions will one attain the absorption that encapsulates all merit.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་པར་བྱེད་པའི་ཆོས་བཞི་སྟེ།
en: “Son of noble family, there could also be said to be four instructions for attaining the absorption that encapsulates all merit.

source: བཞི་གང་ཞེ་ན།
en: What are these four?

source: ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་དང་། ལྟ་བ་ཡོངས་སུ་དག་པ་དང་། སེམས་ཡོངས་སུ་དག་པ་དང་། ཤེས་རབ་ཡོངས་སུ་དག་པ་སྟེ།
en: Purity in discipline, purity in view, purity in mind, and purity in insight.

source: རིགས་ཀྱི་བུ་ཆོས་བཞི་པོ་དེ་དག་ནི་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་པར་བྱེད་པའོ། །
en: Son of noble family, through these four instructions will one attain the absorption that encapsulates all merit.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་པར་བྱེད་པའི་ཆོས་ལྔ་སྟེ།
en: “Son of noble family, there could also be said to be five instructions for attaining the absorption that encapsulates all merit.

source: ལྔ་གང་ཞེ་ན།
en: What are these five?

source: ལྷག་པའི་བསམ་པས་བྱང་ཆུབ་ལ་ཞུགས་པ་དང་།
en: To embrace awakening altruistically;

source: རྟག་ཏུ་བདེན་པའི་ཚིག་སྨྲ་བ་དང་།
en: to speak honestly always;

source: གཡོ་མེད་པ་དང་།
en: to be without hypocrisy;

source: ཕྲག་དོག་མེད་པ་དང་།
en: to be free of envy;

source: སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པ་སྟེ།
en: and to have an attitude of impartiality toward all beings.

source: རིགས་ཀྱི་བུ་ལྔ་པོ་དེ་དག་ནི་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་པར་བྱེད་པའོ། །
en: Son of noble family, through these five instructions will one attain the absorption that encapsulates all merit.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་པར་བྱེད་པའི་ཆོས་དྲུག་སྟེ།
en: “Son of noble family, there could also be said to be six instructions for attaining the absorption that encapsulates all merit.

source: དྲུག་གང་ཞེ་ན་
en: What are these six?

source: དགེ་བའི་བཤེས་གཉེན་བསྟེན་པ་དང་།
en: To study under a spiritual guide;

source: སྡིག་པའི་གྲོགས་པོ་ཡོངས་སུ་སྤོང་བ་དང་།
en: to give up negative companions;

source: ཚོགས་ཀྱི་ཁ་མི་འདྲེན་པ་དང་།
en: not to be a community leader;

source: དབེན་པའི་གནས་ན་གནས་པ་དང་།
en: to dwell in isolated places;

source: བྱམས་པ་ཆེན་པོ་མི་གཏོང་བ་དང་།
en: not to give up great love;

source: སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་སྟེ།
en: and to engender great compassion toward all beings.

source: རིགས་ཀྱི་བུ་ཆོས་དྲུག་པོ་དེ་དག་ནི་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་པར་བྱེད་པའོ། །
en: Son of noble family, through these six instructions will one attain the absorption that encapsulates all merit.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་པར་བྱེད་པའི་ཆོས་བདུན་ཏེ།
en: “Son of noble family, there could also be said to be seven instructions for attaining the absorption that encapsulates all merit.

source: བདུན་གང་ཞེ་ན།
en: What are these seven?

source: ཞི་གནས་ཡོངས་སུ་འཚོལ་བ་དང་།
en: To exert oneself in tranquility;

source: ལྷག་མཐོང་ལ་མཁས་པ་དང་།
en: to be skilled in insight;

source: རྒྱུ་ཡོངས་སུ་ཤེས་པ་དང་།
en: to have comprehension of causes;

source: རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལ་མཁས་པ་དང་།
en: to be expert in dependent origination;

source: ཡང་དག་པར་སྒྲུབ་པ་དང་།
en: to reach genuine accomplishment;

source: ལམ་གྱི་ཚོགས་ཡོངས་སུ་ཚོལ་བ་དང་།
en: to exert oneself in the path of accumulations;

source: ལམ་བསྒོམ་པ་ལ་ལེ་ལོ་མེད་པ་སྟེ།
en: and to be assiduous in training on the path.

source: རིགས་ཀྱི་བུ་བདུན་པོ་དེ་དག་ནི་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་པར་བྱེད་པའོ། །
en: Son of noble family, through these seven instructions will one attain the absorption that encapsulates all merit.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་པར་བྱེད་པའི་ཆོས་བརྒྱད་དེ།
en: “Son of noble family, there could also be said to be eight instructions for attaining the absorption that encapsulates all merit.

source: བརྒྱད་གང་ཞེ་ན་
en: What are these eight?

source: ལུས་ལས་སུ་རུང་བ་ཉིད་དང་།
en: To make one’s body pliable;

source: སེམས་ལས་སུ་རུང་བ་ཉིད་དང་།
en: to make one’s mind pliable;

source: ཚོར་བ་ལ་སོ་སོར་རྟོག་པ་ཉིད་དང་།
en: to have discernment of sensations;

source: ཆོས་ལ་རྗེས་སུ་ལྟ་བ་ཉིད་དང་།
en: to scrutinize phenomena;

source: སྡིག་པ་མི་དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་མི་སྐྱེད་པ་དང་།
en: to avoid giving rise to negative and unwholesome qualities;

source: སྡིག་པ་མི་དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་སྤང་བ་དང་།
en: to give up the negative and unwholesome qualities that have already come about;

source: དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་སྐྱེད་པ་དང་།
en: to engender wholesome qualities that have not yet come about;

source: དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་ཀུན་ནས་བསྲུང་ཞིང་ཡོངས་སུ་སྦྱོང་བ་སྟེ།
en: and to constantly maintain and refine wholesome qualities that have come about.

source: རིགས་ཀྱི་བུ་ཆོས་བརྒྱད་པོ་དེ་དག་ནི་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་པར་བྱེད་པའོ། །
en: Son of noble family, through these eight instructions will one attain the absorption that encapsulates all merit.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་པར་བྱེད་པའི་ཆོས་དགུ་སྟེ།
en: “Son of noble family, there could also be said to be nine instructions for attaining the absorption that encapsulates all merit.

source: དགུ་གང་ཞེ་ན་
en: What are these nine?

source: འདས་པ་མི་ཟད་པའི་ཆོས་ཉིད་དང་། མ་འོངས་པ་མི་ཟད་པའི་ཆོས་ཉིད་དང་། ད་ལྟར་བྱུང་བ་མི་ཟད་པའི་ཆོས་ཉིད་དུ་སོ་སོར་རྟོག་པ་དང་།
en: To discern the unending nature of the past, the unending nature of the future, and the unending nature of what is occurring in the present;

source: སྒྱུ་མའི་ཆོས་ལ་སོ་སོར་རྟོག་པ་དང་།
en: to discern illusory phenomena;

source: དུས་གསུམ་མཉམ་པ་ཉིད་དུ་ཁོང་དུ་ཆུད་པ་དང་།
en: to comprehend the sameness of the three times;

source: ཆོས་ཐམས་ཅད་ལ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་ཀྱི་བཟོད་པ་དང་ལྡན་པ་དང་།
en: to gain spiritual acceptance of how phenomena truly are;

source: སྟོང་པ་ཉིད་མི་སྤོང་བ་དང་།
en: not to abandon emptiness;

source: མཚན་མ་མེད་པ་རྣམ་པར་བསྒོམས་པས་སྨོན་པ་དང་བྲལ་བ་དང་།
en: to familiarize oneself with the absence of marks and thereby become free of expectations;

source: བསམས་བཞིན་དུ་སྲིད་པར་སྐྱེ་བ་སྟེ།
en: and to take rebirth intentionally.

source: རིགས་ཀྱི་བུ་ཆོས་དགུ་པོ་དེ་དག་ནི་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་པར་བྱེད་པའོ། །
en: Son of noble family, through these nine instructions will one attain the absorption that encapsulates all merit.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་པར་བྱེད་པའི་ཆོས་བཅུ་སྟེ།
en: “Son of noble family, there could also be said to be ten instructions for attaining the absorption that encapsulates all merit.

source: བཅུ་གང་ཞེ་ན་
en: What are these ten?

source: བདག་མེད་པ་ལ་མོས་པ་དང་།
en: To have interest in the absence of self;

source: སྲོག་མེད་པ་ལ་བཟོད་པ་དང་།
en: to accept the absence of a soul;

source: གང་ཟག་མེད་པ་ལ་གཅིག་ཏུ་ངེས་པ་དང་།
en: to be fully convinced about the absence of persons;

source: མི་རྟག་པ་ལ་ཡིད་ཆེས་པ་དང་།
en: to have trust in impermanence;

source: སྐྱེ་བ་ཐམས་ཅད་ལ་སེམས་ཅན་དམྱལ་བར་འདུ་ཤེས་པ་དང་།
en: to perceive all rebirths as though they were hellish states;

source: ཕུང་པོ་རྣམས་ལ་གཤེད་མར་འདུ་ཤེས་པ་དང་།
en: to perceive the aggregates as though they were executioners;

source: ཁམས་རྣམས་ལ་སྦྲུལ་གདུག་པར་འདུ་ཤེས་པ་དང་།
en: to perceive the elements as though they were poisonous snakes;

source: སྐྱེ་མཆེད་རྣམས་ལ་གྲོང་སྟོང་པར་འདུ་ཤེས་པ་དང་།
en: to perceive the sense bases as though they were vacant cities;

source: སྲིད་པ་རྣམས་ལ་ངེས་པར་འབྱུང་བར་འདུ་ཤེས་པ་དང་།
en: to perceive existences with an attitude of renunciation;

source: རྣམ་པར་ཐར་པའི་སྒོ་རྣམས་ལ་འདྲིས་པར་འདུ་ཤེས་པ་སྟེ།
en: and to perceive the gateways to liberation with a sense of familiarity.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་ནི་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་པར་བྱེད་པའོ། །
en: Son of noble family, through these ten instructions will one attain the absorption that encapsulates all merit.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཚན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The mighty strongman Vimalatejā then said to the Blessed One,

source: བཅོམ་ལྡན་འདས་བསོད་ནམས་ཀྱི་ཚོགས་ཡང་དག་པར་བསྡུ་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་མཉན་པར་བགྱིའོ། །
en: “Blessed One, those bodhisattva great beings who seek to gather an accumulation of merit correctly will listen to this absorption that encapsulates all merit.

source: བསོད་ནམས་སོགས་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་མཉན་པར་བགྱིའོ། །
en: Those bodhisattva great beings who seek to increase their merit will listen to this absorption that encapsulates all merit.

source: བསོད་ནམས་བསམ་གྱིས་མི་ཁྱབ་པ་འཐོབ་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་མཉན་པར་བགྱི། མོས་པར་བགྱིའོ། །
en: Those bodhisattva great beings who seek to attain an inconceivable amount of merit will listen and devote themselves to this absorption that encapsulates all merit.

source: བསོད་ནམས་མི་ཟད་པ་འཐོབ་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཏིང་ངེ་འཛིན་འདི་ལ་བརྩོན་པར་བགྱིའོ། །
en: Those bodhisattva great beings who seek to attain inexhaustible merit will exert themselves in this absorption.

source: བསོད་ནམས་རྒྱ་མཚོ་འཐོབ་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཏིང་ངེ་འཛིན་འདི་གཟུང་བར་བགྱི།
en: Those bodhisattva great beings who seek to attain an ocean of merit will take up this absorption;

source: བཅང་བར་བགྱི། བཀླག་པར་བགྱི། བཤད་པར་བགྱིའོ། །
en: they will uphold it, read it, and explain it.

source: བསོད་ནམས་བརྒྱའི་མཚན་ཡོངས་སུ་གཟུང་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཏིང་ངེ་འཛིན་འདི་སྒོམ་པའི་རྣལ་འབྱོར་ལ་བརྩོན་པར་བགྱིའོ། །
en: Those bodhisattva great beings who seek to acquire the ‘marks of one hundred merits’ will exert themselves in the practice of meditating on this absorption.”

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ལ་ཚན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The mighty strongman Vimalatejā then continued his questions to the Blessed One:

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མངོན་པར་བརྩོན་པས་འདི་ལྟ་སྟེ། བསོད་ནམས་མི་ཟད་པ་དང་། བསོད་ནམས་རྒྱ་མཚོ་དང་། བསོད་ནམས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། བསོད་ནམས་སྩོགས་པ་དང་། བསོད་ནམས་བརྒྱའི་མཚན་གྱི་ཆོས་འདི་དག་ཇི་ལྟར་ཡོངས་སུ་རྫོགས་པར་བགྱིད་པ་ལགས།
en: “Blessed One, how is it that a bodhisattva great being should endeavor in order to perfect such qualities as these—inexhaustible merit, ocean-like merit, inconceivable merit, the accumulation of merit, and the marks of one hundred merits?”

source: རིགས་ཀྱི་བུ་གསུམ་པོ་འདི་དག་ནི་བསོད་ནམས་ཉེ་བར་རྟོན་པ་དང་། བསོད་ནམས་ཀྱི་ཚོགས་དང་། བསོད་ནམས་འདུ་བ་དང་། བསོད་ནམས་རྒྱས་པ་དང་། བསོད་ནམས་མི་ཟད་པ་དང་། བསོད་ནམས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། བསོད་ནམས་རྒྱ་མཚོ་ཡིན་ཏེ
en: “Son of noble family, there are three things that constitute the foundation of merit, the accumulation of merit, the gathering of merit, the expansion of merit, the inexhaustibility of merit, inconceivable merit, and ocean-like merit.

source: སྦྱིན་པའི་ཚོགས་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཚོགས་དང་། ཐོས་པའི་ཚོགས་སོ། །
en: They are the accumulations of generosity, discipline, and learning.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པའི་ཚོགས་ལ་ཇི་ལྟར་བརྩོན་པར་བྱ་ཞེ་ན།
en: “Son of noble family, how should bodhisattva great beings endeavor in accumulating generosity, you ask?

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དངོས་པོ་གང་ལ་དེའི་གཏོང་བའི་སེམས་མི་སྐྱེ་ཞིང་གཏོང་བའི་བློ་མི་འབྱུང་བའི་དངོས་པོ་དེ་བླང་བར་མི་བྱའོ། །
en: Son of noble family, bodhisattva great beings should not accept anything unless they can imagine giving it away and have an attitude of generosity toward it.

source: ཡོངས་སུ་གཟུང་བ་གང་ལ་བཏང་བའི་སེམས་མི་སྐྱེ་བའི་ཡོངས་སུ་གཟུང་བ་དེ་ཡོངས་སུ་གཟུང་བར་མི་བྱའོ། །
en: They should not keep any possession unless they are willing to give it away.

source: གང་ལ་སློང་བ་རྣམས་ཀྱིས་བསླངས་ན་ཡོངས་སུ་འཛིན་པའི་བློ་སྐྱེ་བའི་གཡོག་འཁོར་དེ་གཟུང་བར་མི་བྱའོ། །
en: They should not keep any attendants or any retinue that creates a feeling of attachment when others ask for it.

source: དངོས་པོ་གང་ལ་སློང་བ་རྣམས་ཀྱིས་བསླངས་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་གཏོང་བའི་བློ་སྐྱེ་བར་འགྱུར་བའི་རྒྱལ་སྲིད་དེ་བླང་བར་མི་བྱའོ། །
en: Bodhisattvas should not accept a kingdom that they would be unable to give away when others ask for it.

source: ལོངས་སྤྱོད་དེ་དག་དང་། ནོར་དེ་དག་དང་། རྫས་དེ་དག་དང་། རིན་པོ་ཆེ་དེ་དག་བླང་བར་མི་བྱ་བ་ནས་དེ་ལྟ་བུའི་དངོས་པོ་ཅི་ཡང་རུང་བའི་བར་དུ་བླང་བར་མི་བྱའོ། །
en: They should not accept any such things, whether enjoyments, wealth, material objects, or precious items, whatever they may be.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འདི་སྙམ་དུ་སེམས་བསྐྱེད་པར་བྱ་སྟེ།
en: “Furthermore, son of noble family, bodhisattva great beings should think in this way:

source: བདག་གི་ལུས་འདི་ཡང་སེམས་ཅན་ཐམས་ཅད་ལ་གཏང་སྟེ་ཡོངས་སུ་གཏང་ན་ཕྱི་རོལ་ཀྱི་དངོས་པོ་རྣམས་ལྟ་ཅི་སྨོས་སྙམ་དུ་སེམས་བསྐྱེད་པར་བྱའོ། །
en: ‘I will give this very body of mine away to all beings, and if I can give this away, what need to mention external, material things?’

source: གཞན་ཡང་སེམས་ཅན་གང་དང་གང་ལ་དངོས་པོ་གང་དང་གང་གིས་དངོས་པོ་གང་དང་གང་བྱེད་པར་འགྱུར་བ་དེ་ཡོད་ན་དེ་དང་དེ་ལ་དེ་དང་དེ་མི་དགའ་བ་མེད་པ་དང་འགྱོད་པ་མེད་པར་སྦྱིན་པར་བྱ་སྟེ
en: And also: ‘If there is anyone who could make use of anything I have, I will give that thing to that being, without any resentment or regret.

source: ལག་པ་འདོད་པ་རྣམས་ལ་ལག་པ་ཡང་སྦྱིན་ནོ། །
en: I will give my arms to those who want arms,

source: རྐང་པ་འདོད་པ་རྣམས་ལ་རྐང་པ་དང་། མིག་འདོད་པ་རྣམས་ལ་མིག་ཀྱང་སྦྱིན་ནོ། །
en: my legs to those who want legs, and my eyes to those who want eyes.

source: ཤ་འདོད་པ་རྣམས་ལ་ཤ་དང་། ཁྲག་འདོད་པ་རྣམས་ལ་ཁྲག་དང་། རྐང་འདོད་པ་རྣམས་ལ་རྐང་དང་། ཡན་ལག་དང་ཉིང་ལག་འདོད་པ་རྣམས་ལ། ཡན་ལག་དང་ཉིང་ལག་དང་། མགོ་བོ་འདོད་པ་རྣམས་ལ་མགོ་བོ་ཡང་ཡོངས་སུ་གཏོང་བར་བྱ་ན།
en: I will give away my flesh to those who want flesh, my blood to those who want blood, my marrow to those who want marrow, all parts of my body to those who want them, and even my head to those who want a head.

source: ཕྱི་རོལ་གྱི་དངོས་པོ་འདི་ལྟ་སྟེ། ནོར་དང་། འབྲུ་དང་། གསེར་དང་། དངུལ་དང་། རིན་པོ་ཆེ་དང་། རྒྱན་དང་། རྟ་དང་། གླང་པོ་ཆེ་དང་། ཤིང་རྟ་དང་། བཞོན་པ་དང་། གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་དང་། ཚོང་འདུས་དང་། རི་འོར་བ་དང་། བྲན་དང་། བྲན་མོ་དང་། ལས་བྱེད་པ་དང་། བུ་དང་། བུ་མོ་དང་། ཆུང་མ་དང་། འཁོར་རྣམས་ལྟ་ཅི་སྨོས།
en: Of course the same thing goes for physical possessions such as my wealth, grain, gold, silver, gems, jewelry, horses, elephants, chariots, riding mounts, villages, cities, towns, countries, kingdoms, palaces, marketplaces, mountain hamlets, male and female servants, employees, sons, daughters, wives, or retinue.

source: གཞན་ཡང་སེམས་ཅན་གང་དང་གང་ལ་གང་དང་གང་གིས་དོན་བྱེད་པར་འགྱུར་བ་དེ་དང་དེ་ཡོད་ན་དེ་དང་དེ་ལ་དངོས་པོ་དེ་དང་དེ་སྦྱིན་པར་བྱ་སྟེ།
en: “ ‘Furthermore, if there is anyone whose aims could be met with anything that I may have, I will give it to that being;

source: མི་དགའ་བ་མེད་པ་དང་། འགྱོད་པ་མེད་པ་དང་། རྣམ་པར་སྨིན་པ་ལ་མི་རེ་བར་ཡོངས་སུ་གཏོང་བར་བྱའོ། །
en: I will give it away without any sense of resentment or regret, nor any hope for reward.

source: མི་ལྟ་བར་སྦྱིན་པར་བྱའོ། །
en: I will do so no matter what.
